lixpaulian/efr32xx-rail/platform/emlib/src/em_opamp.c
    dac->CH1CTRL |= DAC_CH1CTRL_EN;
    dac->OPACTRL  = (dac->OPACTRL
                     & ~(DAC_OPACTRL_OPA1SHORT
                         | _DAC_OPACTRL_OPA1LPFDIS_MASK
                         | DAC_OPACTRL_OPA1HCMDIS))
                    | (init->shortInputs ? DAC_OPACTRL_OPA1SHORT : 0)
                    | (init->lpfPosPadDisable
                       ? DAC_OPACTRL_OPA1LPFDIS_PLPFDIS : 0)
                    | (init->lpfNegPadDisable
                       ? DAC_OPACTRL_OPA1LPFDIS_NLPFDIS : 0)
                    | (init->hcmDisable ? DAC_OPACTRL_OPA1HCMDIS : 0)
                    | DAC_OPACTRL_OPA1EN;
  } else { /* OPA2 */
    EFM_ASSERT((init->posSel == DAC_OPA2MUX_POSSEL_DISABLE)
               || (init->posSel == DAC_OPA2MUX_POSSEL_POSPAD)
               || (init->posSel == DAC_OPA2MUX_POSSEL_OPA1INP)
               || (init->posSel == DAC_OPA2MUX_POSSEL_OPATAP));

    EFM_ASSERT((init->outMode & ~DAC_OPA2MUX_OUTMODE) == 0);

    EFM_ASSERT((init->outPen & ~_DAC_OPA2MUX_OUTPEN_MASK) == 0);

    dac->BIASPROG = (dac->BIASPROG
                     & ~(_DAC_BIASPROG_OPA2BIASPROG_MASK
                         | DAC_BIASPROG_OPA2HALFBIAS))
                    | (init->bias << _DAC_BIASPROG_OPA2BIASPROG_SHIFT)
                    | (init->halfBias ? DAC_BIASPROG_OPA2HALFBIAS : 0);

    if (init->defaultOffset) {
      offset = SYSTEM_GetCalibrationValue(&dac->OPAOFFSET);
      dac->OPAOFFSET = (dac->OPAOFFSET & ~_DAC_OPAOFFSET_OPA2OFFSET_MASK)
                       | (offset       &  _DAC_OPAOFFSET_OPA2OFFSET_MASK);
    } else {
      EFM_ASSERT(init->offset <= (_DAC_OPAOFFSET_OPA2OFFSET_MASK
                                  >> _DAC_OPAOFFSET_OPA2OFFSET_SHIFT));
      dac->OPAOFFSET = (dac->OPAOFFSET & ~_DAC_OPAOFFSET_OPA2OFFSET_MASK)
                       | (init->offset << _DAC_OPAOFFSET_OPA2OFFSET_SHIFT);
    }

    dac->OPA2MUX  = (uint32_t)init->resSel
                    | (uint32_t)init->outMode
                    | init->outPen
                    | (uint32_t)init->resInMux
                    | (uint32_t)init->negSel
                    | (uint32_t)init->posSel
                    | (init->nextOut ? DAC_OPA2MUX_NEXTOUT : 0)
                    | (init->npEn    ? DAC_OPA2MUX_NPEN    : 0)
                    | (init->ppEn    ? DAC_OPA2MUX_PPEN    : 0);

    dac->OPACTRL  = (dac->OPACTRL
                     & ~(DAC_OPACTRL_OPA2SHORT
                         | _DAC_OPACTRL_OPA2LPFDIS_MASK
                         | DAC_OPACTRL_OPA2HCMDIS))
                    | (init->shortInputs ?  DAC_OPACTRL_OPA2SHORT : 0)
                    | (init->lpfPosPadDisable
                       ? DAC_OPACTRL_OPA2LPFDIS_PLPFDIS : 0)
                    | (init->lpfNegPadDisable
                       ? DAC_OPACTRL_OPA2LPFDIS_NLPFDIS : 0)
                    | (init->hcmDisable ? DAC_OPACTRL_OPA2HCMDIS : 0)
                    | DAC_OPACTRL_OPA2EN;
  }

#elif defined(_SILICON_LABS_32B_SERIES_1)
  uint32_t calData = 0;
  uint32_t warmupTime;

  EFM_ASSERT(VDAC_REF_VALID(dac));
  EFM_ASSERT(VDAC_OPA_VALID(opa));
  EFM_ASSERT(init->settleTime <= (_VDAC_OPA_TIMER_SETTLETIME_MASK
                                  >> _VDAC_OPA_TIMER_SETTLETIME_SHIFT));
  EFM_ASSERT(init->startupDly <= (_VDAC_OPA_TIMER_STARTUPDLY_MASK
                                  >> _VDAC_OPA_TIMER_STARTUPDLY_SHIFT));
  EFM_ASSERT((init->outPen & ~_VDAC_OPA_OUT_ALTOUTPADEN_MASK) == 0);
  EFM_ASSERT(!((init->gain3xEn == true)
               && ((init->negSel == opaNegSelResTap)
                   || (init->posSel == opaPosSelResTap))));
  EFM_ASSERT((init->drvStr == opaDrvStrLowerAccLowStr)
             || (init->drvStr == opaDrvStrLowAccLowStr)
             || (init->drvStr == opaDrvStrHighAccHighStr)
             || (init->drvStr == opaDrvStrHigherAccHighStr));

  /* Disable OPAMP before writing to registers. */
  OPAMP_Disable(dac, opa);

  /* Get the calibration value based on OPAMP, Drive Strength, and INCBW. */
  switch (opa) {
    case OPA0:
      switch (init->drvStr) {
        case opaDrvStrLowerAccLowStr:
          calData = (init->ugBwScale ? DEVINFO->OPA0CAL0 : DEVINFO->OPA0CAL4);
          break;
        case opaDrvStrLowAccLowStr:
          calData = (init->ugBwScale ? DEVINFO->OPA0CAL1 : DEVINFO->OPA0CAL5);
          break;
        case opaDrvStrHighAccHighStr:
          calData = (init->ugBwScale ? DEVINFO->OPA0CAL2 : DEVINFO->OPA0CAL6);
          break;
        case opaDrvStrHigherAccHighStr:
          calData = (init->ugBwScale ? DEVINFO->OPA0CAL3 : DEVINFO->OPA0CAL7);
          break;
      }
      break;

    case OPA1:
      switch (init->drvStr) {
        case opaDrvStrLowerAccLowStr:
          calData = (init->ugBwScale ? DEVINFO->OPA1CAL0 : DEVINFO->OPA1CAL4);
          break;
        case opaDrvStrLowAccLowStr:
          calData = (init->ugBwScale ? DEVINFO->OPA1CAL1 : DEVINFO->OPA1CAL5);
          break;
        case opaDrvStrHighAccHighStr:
          calData = (init->ugBwScale ? DEVINFO->OPA1CAL2 : DEVINFO->OPA1CAL6);
          break;
        case opaDrvStrHigherAccHighStr:
          calData = (init->ugBwScale ? DEVINFO->OPA1CAL3 : DEVINFO->OPA1CAL7);
          break;
      }
      break;

    case OPA2:
      switch (init->drvStr) {
        case opaDrvStrLowerAccLowStr:
          calData = (init->ugBwScale ? DEVINFO->OPA2CAL0 : DEVINFO->OPA2CAL4);
          break;
        case opaDrvStrLowAccLowStr:
          calData = (init->ugBwScale ? DEVINFO->OPA2CAL1 : DEVINFO->OPA2CAL5);
          break;
        case opaDrvStrHighAccHighStr:
          calData = (init->ugBwScale ? DEVINFO->OPA2CAL2 : DEVINFO->OPA2CAL6);
          break;
        case opaDrvStrHigherAccHighStr:
          calData = (init->ugBwScale ? DEVINFO->OPA2CAL3 : DEVINFO->OPA2CAL7);
          break;
      }
      break;
  }
  if (!init->defaultOffsetN) {
    EFM_ASSERT(init->offsetN <= (_VDAC_OPA_CAL_OFFSETN_MASK
                                 >> _VDAC_OPA_CAL_OFFSETN_SHIFT));
    calData = (calData & ~_VDAC_OPA_CAL_OFFSETN_MASK)
              | (init->offsetN << _VDAC_OPA_CAL_OFFSETN_SHIFT);
  }
  if (!init->defaultOffsetP) {
    EFM_ASSERT(init->offsetP <= (_VDAC_OPA_CAL_OFFSETP_MASK
                                 >> _VDAC_OPA_CAL_OFFSETP_SHIFT));
    calData = (calData & ~_VDAC_OPA_CAL_OFFSETP_MASK)
              | (init->offsetP << _VDAC_OPA_CAL_OFFSETP_SHIFT);
  }

  dac->OPA[opa].CAL = (calData &  _VDAC_OPA_CAL_MASK);

  dac->OPA[opa].MUX = (uint32_t)init->resSel
                      | (init->gain3xEn  ? VDAC_OPA_MUX_GAIN3X : 0)
                      | (uint32_t)init->resInMux
                      | (uint32_t)init->negSel
                      | (uint32_t)init->posSel;

  dac->OPA[opa].OUT = (uint32_t)init->outMode
                      | (uint32_t)init->outPen;

  switch (init->drvStr) {
    case opaDrvStrHigherAccHighStr:
      warmupTime = 6;
      break;

